# Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел,
# разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

summa = 0
line = None

while line != 'exit':
    line = input("Введите числа, разделенные пробелом или exit для выхода >>> ").split()
    if line[0] == 'exit':
        break
    else:
        for i in line:
                summa += int(i)
    print(summa)