# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3,
# а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
from itertools import count, cycle

# а) итератор, генерирующий целые числа
for el in count(3):
    if el > 10:
        break
    else:
        print(el)
print("Конец скрипта а")

# б) итератор, повторяющий элементы некоторого списка
c = 0
for el in cycle("ython p"):
    if c > 11:
        break
    print(el)
    c += 1
print("Конец скрипта б")